examples-results/HsacExamples.SlimTests.HttpTests.HttpPost2UsingScenarioTest.html

<html><head><title>HsacExamples.SlimTests.HttpTests.HttpPost2UsingScenarioTest</title><meta http-equiv='Content-Type' content='text/html;charset=UTF-8'/><link rel='stylesheet' type='text/css' href='css/fitnesse.css'/><script src='javascript/jquery-1.11.3.min.js' type='text/javascript'></script><script src='javascript/fitnesse.js' type='text/javascript'></script></head><body><header><h2>HsacExamples.SlimTests.HttpTests.HttpPost2UsingScenarioTest</h2></header><article><br/><h2>Body via scenario</h2>
<br/>Using a scenario allows us to generate multiple request, only changing certain values.<br/><br/><div class="collapsible closed"><ul><li><a href='#' class='expandall'>Expand</a></li><li><a href='#' class='collapseall'>Collapse</a></li></ul>
	<p class="title">Scenario definition</p>
	<div><span class="meta">variable defined: POST_BODY_2= {{{
&lt;s11:Envelope xmlns:s11="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;s11:Body&gt;
    &lt;ns1:GetCityWeatherByZIP xmlns:ns1="http://ws.cdyne.com/WeatherWS/"&gt;
      &lt;ns1:ZIP&gt;@{zip}&lt;/ns1:ZIP&gt;
    &lt;/ns1:GetCityWeatherByZIP&gt;
  &lt;/s11:Body&gt;
&lt;/s11:Envelope&gt;
}}} </span>
<br/><br/><table>
	<tr class="slimRowTitle">
		<td>script</td>
		<td><span class="pass">xml http test</span></td>
	</tr>
</table>
<br/><table>
	<tr>
		<td>table template</td>
		<td colspan="3">send request</td>
	</tr>
	<tr>
		<td>post</td>
		<td><pre>
&lt;s11:Envelope xmlns:s11="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;s11:Body&gt;
    &lt;ns1:GetCityWeatherByZIP xmlns:ns1="http://ws.cdyne.com/WeatherWS/"&gt;
      &lt;ns1:ZIP&gt;@{zip}&lt;/ns1:ZIP&gt;
    &lt;/ns1:GetCityWeatherByZIP&gt;
  &lt;/s11:Body&gt;
&lt;/s11:Envelope&gt;
</pre></td>
		<td>to</td>
		<td><a href="http://wsf.cdyne.com/WeatherWS/Weather.asmx">http://wsf.cdyne.com/WeatherWS/Weather.asmx</a></td>
	</tr>
	<tr>
		<td>check</td>
		<td>response status</td>
		<td colspan="2">200</td>
	</tr>
	<tr>
		<td>show</td>
		<td colspan="3">response</td>
	</tr>
	<tr>
		<td>register prefix</td>
		<td>weather</td>
		<td>for namespace</td>
		<td><a href="http://ws.cdyne.com/WeatherWS/">http://ws.cdyne.com/WeatherWS/</a></td>
	</tr>
	<tr>
		<td>$City=</td>
		<td>xPath</td>
		<td colspan="2">//weather:City/text()</td>
	</tr>
</table>
</div>
</div>
<br/><table>
	<tr>
		<td colspan="2">send request</td>
	</tr>
	<tr>
		<td>zip</td>
		<td>City?</td>
	</tr>
	<tr class="scenario closed">
		<td class="fail">10007</td>
		<td class="fail">New York <span class="ignore">Test not run</span></td>
	</tr><tr class="scenario-detail closed-detail"><td colspan="2"><table>
	<tr>
		<td>table template</td>
		<td colspan="3">send request</td>
	</tr>
	<tr>
		<td><span class="fail">post</span></td>
		<td><pre>
&lt;s11:Envelope xmlns:s11="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;s11:Body&gt;
    &lt;ns1:GetCityWeatherByZIP xmlns:ns1="http://ws.cdyne.com/WeatherWS/"&gt;
      &lt;ns1:ZIP&gt;10007&lt;/ns1:ZIP&gt;
    &lt;/ns1:GetCityWeatherByZIP&gt;
  &lt;/s11:Body&gt;
&lt;/s11:Envelope&gt;
</pre></td>
		<td>to</td>
		<td><a href="http://wsf.cdyne.com/WeatherWS/Weather.asmx">http://wsf.cdyne.com/WeatherWS/Weather.asmx</a></td>
	</tr>
	<tr>
		<td>check</td>
		<td>response status</td>
		<td colspan="2">[<span class="diff">5</span>00] <span class="fail">expected [</span><span class="diff">2</span><span class="fail">00]</span></td>
	</tr>
	<tr>
		<td>show</td>
		<td colspan="3">response</td>
	<td><pre>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;&lt;soap:Envelope xmlns:soap=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot;&gt;
    &lt;soap:Body&gt;
        &lt;soap:Fault&gt;
            &lt;faultcode&gt;soap:Server&lt;/faultcode&gt;
            &lt;faultstring&gt;Server was unable to process request. ---&amp;gt; A network-related or instance-specific error occurred while establishing a connection to SQL Server. The server was not found or was not accessible. Verify that the instance name is correct and that SQL Server is configured to allow remote connections. (provider: Named Pipes Provider, error: 40 - Could not open a connection to SQL Server)&lt;/faultstring&gt;
            &lt;detail/&gt;
        &lt;/soap:Fault&gt;
    &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt;
</pre></td></tr>
	<tr>
		<td>register prefix</td>
		<td>weather</td>
		<td>for namespace</td>
		<td><a href="http://ws.cdyne.com/WeatherWS/">http://ws.cdyne.com/WeatherWS/</a></td>
	</tr>
	<tr>
		<td>$City= <span class="error"><div>SOAP fault received: <pre>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;&lt;soap:Envelope xmlns:soap=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot;&gt;<br/>    &lt;soap:Body&gt;<br/>        &lt;soap:Fault&gt;<br/>            &lt;faultcode&gt;soap:Server&lt;/faultcode&gt;<br/>            &lt;faultstring&gt;Server was unable to process request. ---&amp;gt; A network-related or instance-specific error occurred while establishing a connection to SQL Server. The server was not found or was not accessible. Verify that the instance name is correct and that SQL Server is configured to allow remote connections. (provider: Named Pipes Provider, error: 40 - Could not open a connection to SQL Server)&lt;/faultstring&gt;<br/>            &lt;detail/&gt;<br/>        &lt;/soap:Fault&gt;<br/>    &lt;/soap:Body&gt;<br/>&lt;/soap:Envelope&gt;<br/></pre></div></span></td>
		<td>xPath</td>
		<td colspan="2">//weather:City/text()</td>
	</tr>
</table></td></tr>
	<tr class="scenario closed">
		<td class="fail">94102</td>
		<td class="fail">San Francisco <span class="ignore">Test not run</span></td>
	</tr><tr class="scenario-detail closed-detail"><td colspan="2"><table>
	<tr>
		<td>table template</td>
		<td colspan="3">send request</td>
	</tr>
	<tr>
		<td><span class="fail">post</span></td>
		<td><pre>
&lt;s11:Envelope xmlns:s11="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;s11:Body&gt;
    &lt;ns1:GetCityWeatherByZIP xmlns:ns1="http://ws.cdyne.com/WeatherWS/"&gt;
      &lt;ns1:ZIP&gt;94102&lt;/ns1:ZIP&gt;
    &lt;/ns1:GetCityWeatherByZIP&gt;
  &lt;/s11:Body&gt;
&lt;/s11:Envelope&gt;
</pre></td>
		<td>to</td>
		<td><a href="http://wsf.cdyne.com/WeatherWS/Weather.asmx">http://wsf.cdyne.com/WeatherWS/Weather.asmx</a></td>
	</tr>
	<tr>
		<td>check</td>
		<td>response status</td>
		<td colspan="2">[<span class="diff">5</span>00] <span class="fail">expected [</span><span class="diff">2</span><span class="fail">00]</span></td>
	</tr>
	<tr>
		<td>show</td>
		<td colspan="3">response</td>
	<td><pre>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;&lt;soap:Envelope xmlns:soap=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot;&gt;
    &lt;soap:Body&gt;
        &lt;soap:Fault&gt;
            &lt;faultcode&gt;soap:Server&lt;/faultcode&gt;
            &lt;faultstring&gt;Server was unable to process request. ---&amp;gt; A network-related or instance-specific error occurred while establishing a connection to SQL Server. The server was not found or was not accessible. Verify that the instance name is correct and that SQL Server is configured to allow remote connections. (provider: Named Pipes Provider, error: 40 - Could not open a connection to SQL Server)&lt;/faultstring&gt;
            &lt;detail/&gt;
        &lt;/soap:Fault&gt;
    &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt;
</pre></td></tr>
	<tr>
		<td>register prefix</td>
		<td>weather</td>
		<td>for namespace</td>
		<td><a href="http://ws.cdyne.com/WeatherWS/">http://ws.cdyne.com/WeatherWS/</a></td>
	</tr>
	<tr>
		<td>$City= <span class="error"><div>SOAP fault received: <pre>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;&lt;soap:Envelope xmlns:soap=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot;&gt;<br/>    &lt;soap:Body&gt;<br/>        &lt;soap:Fault&gt;<br/>            &lt;faultcode&gt;soap:Server&lt;/faultcode&gt;<br/>            &lt;faultstring&gt;Server was unable to process request. ---&amp;gt; A network-related or instance-specific error occurred while establishing a connection to SQL Server. The server was not found or was not accessible. Verify that the instance name is correct and that SQL Server is configured to allow remote connections. (provider: Named Pipes Provider, error: 40 - Could not open a connection to SQL Server)&lt;/faultstring&gt;<br/>            &lt;detail/&gt;<br/>        &lt;/soap:Fault&gt;<br/>    &lt;/soap:Body&gt;<br/>&lt;/soap:Envelope&gt;<br/></pre></div></span></td>
		<td>xPath</td>
		<td colspan="2">//weather:City/text()</td>
	</tr>
</table></td></tr>
</table>
</article></body></html>