Object Repository/SOAP12 (2)/GetCityForecastByZIP.rs

<?xml version="1.0" encoding="UTF-8"?>
<WebServiceRequestEntity>
   <description></description>
   <name>GetCityForecastByZIP</name>
   <tag></tag>
   <elementGuidId>e168caa9-1827-4ce7-ad68-bfb1151c7cdd</elementGuidId>
   <selectorMethod>BASIC</selectorMethod>
   <useRalativeImagePath>false</useRalativeImagePath>
   <followRedirects>false</followRedirects>
   <httpBody></httpBody>
   <httpBodyContent></httpBodyContent>
   <httpBodyType></httpBodyType>
   <restRequestMethod></restRequestMethod>
   <restUrl></restUrl>
   <serviceType>SOAP</serviceType>
   <soapBody>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?>&lt;soap:Envelope xmlns:soap=&quot;http://www.w3.org/2003/05/soap-envelope&quot; xmlns:weat=&quot;http://ws.cdyne.com/WeatherWS/&quot;>
   &lt;soap:Header/>
   &lt;soap:Body>
      &lt;weat:GetCityForecastByZIP>
         &lt;weat:ZIP>gero et&lt;/weat:ZIP>
      &lt;/weat:GetCityForecastByZIP>
   &lt;/soap:Body>
&lt;/soap:Envelope>
</soapBody>
   <soapHeader></soapHeader>
   <soapRequestMethod>SOAP12</soapRequestMethod>
   <soapServiceFunction>GetCityForecastByZIP</soapServiceFunction>
   <wsdlAddress>http://wsf.cdyne.com/WeatherWS/Weather.asmx?WSDL</wsdlAddress>
</WebServiceRequestEntity>
